zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_PFLASH.h
#define PFLASH_PFCR_P2_DPFEN_MASK                (0x20U)
#define PFLASH_PFCR_P2_DPFEN_SHIFT               (5U)
/*! P2_DPFEN - Port2 Data Prefetch Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PFLASH_PFCR_P2_DPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << PFLASH_PFCR_P2_DPFEN_SHIFT)) & PFLASH_PFCR_P2_DPFEN_MASK)
/*! @} */

/* The count of PFLASH_PFCR */
#define PFLASH_PFCR_COUNT                        (3U)

/*! @name PFCR4 - Platform Flash Memory Configuration 4 */
/*! @{ */

#define PFLASH_PFCR4_DERR_SUP_MASK               (0x1U)
#define PFLASH_PFCR4_DERR_SUP_SHIFT              (0U)
/*! DERR_SUP - Data Error Suppression
 *  0b0..Reports ECC events on data flash memory accesses
 *  0b1..Single-bit and multi-bit ECC events on data flash memory accesses are suppressed
 */
#define PFLASH_PFCR4_DERR_SUP(x)                 (((uint32_t)(((uint32_t)(x)) << PFLASH_PFCR4_DERR_SUP_SHIFT)) & PFLASH_PFCR4_DERR_SUP_MASK)

#define PFLASH_PFCR4_BLK4_PS_MASK                (0xEU)
#define PFLASH_PFCR4_BLK4_PS_SHIFT               (1U)
/*! BLK4_PS - Block 4 Pipe Select
 *  0b000..Block 4 access is always through pipe0
 *  0b001..Block 4 access is always through pipe1
 *  0b010..Block 4 access is always through pipe2
 *  0b011..Block 4 access is always through pipe3
 *  0b1xx..Block 4 access can be through any of the command pipes, based on which command pipe is available for block 4 access
 */
#define PFLASH_PFCR4_BLK4_PS(x)                  (((uint32_t)(((uint32_t)(x)) << PFLASH_PFCR4_BLK4_PS_SHIFT)) & PFLASH_PFCR4_BLK4_PS_MASK)

#define PFLASH_PFCR4_DMEEE_MASK                  (0x80U)
#define PFLASH_PFCR4_DMEEE_SHIFT                 (7U)
/*! DMEEE - Disable Multi-Bit ECC Error Exception
 *  0b0..Error response sent on system bus for multi-bit ECC error
 *  0b1..Error response not sent on system bus for multi-bit ECC error
 */
#define PFLASH_PFCR4_DMEEE(x)                    (((uint32_t)(((uint32_t)(x)) << PFLASH_PFCR4_DMEEE_SHIFT)) & PFLASH_PFCR4_DMEEE_MASK)
/*! @} */

/*! @name PFAPR - Platform Flash Memory Access Protection */
/*! @{ */

#define PFLASH_PFAPR_M15AP_MASK                  (0x3U)
#define PFLASH_PFAPR_M15AP_SHIFT                 (0U)
/*! M15AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M15AP(x)                    (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M15AP_SHIFT)) & PFLASH_PFAPR_M15AP_MASK)

#define PFLASH_PFAPR_M14AP_MASK                  (0xCU)
#define PFLASH_PFAPR_M14AP_SHIFT                 (2U)
/*! M14AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M14AP(x)                    (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M14AP_SHIFT)) & PFLASH_PFAPR_M14AP_MASK)

#define PFLASH_PFAPR_M13AP_MASK                  (0x30U)
#define PFLASH_PFAPR_M13AP_SHIFT                 (4U)
/*! M13AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M13AP(x)                    (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M13AP_SHIFT)) & PFLASH_PFAPR_M13AP_MASK)

#define PFLASH_PFAPR_M12AP_MASK                  (0xC0U)
#define PFLASH_PFAPR_M12AP_SHIFT                 (6U)
/*! M12AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M12AP(x)                    (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M12AP_SHIFT)) & PFLASH_PFAPR_M12AP_MASK)

#define PFLASH_PFAPR_M11AP_MASK                  (0x300U)
#define PFLASH_PFAPR_M11AP_SHIFT                 (8U)
/*! M11AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M11AP(x)                    (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M11AP_SHIFT)) & PFLASH_PFAPR_M11AP_MASK)

#define PFLASH_PFAPR_M10AP_MASK                  (0xC00U)
#define PFLASH_PFAPR_M10AP_SHIFT                 (10U)
/*! M10AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M10AP(x)                    (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M10AP_SHIFT)) & PFLASH_PFAPR_M10AP_MASK)

#define PFLASH_PFAPR_M9AP_MASK                   (0x3000U)
#define PFLASH_PFAPR_M9AP_SHIFT                  (12U)
/*! M9AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M9AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M9AP_SHIFT)) & PFLASH_PFAPR_M9AP_MASK)

#define PFLASH_PFAPR_M8AP_MASK                   (0xC000U)
#define PFLASH_PFAPR_M8AP_SHIFT                  (14U)
/*! M8AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M8AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M8AP_SHIFT)) & PFLASH_PFAPR_M8AP_MASK)

#define PFLASH_PFAPR_M7AP_MASK                   (0x30000U)
#define PFLASH_PFAPR_M7AP_SHIFT                  (16U)
/*! M7AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M7AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M7AP_SHIFT)) & PFLASH_PFAPR_M7AP_MASK)

#define PFLASH_PFAPR_M6AP_MASK                   (0xC0000U)
#define PFLASH_PFAPR_M6AP_SHIFT                  (18U)
/*! M6AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M6AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M6AP_SHIFT)) & PFLASH_PFAPR_M6AP_MASK)

#define PFLASH_PFAPR_M5AP_MASK                   (0x300000U)
#define PFLASH_PFAPR_M5AP_SHIFT                  (20U)
/*! M5AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M5AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M5AP_SHIFT)) & PFLASH_PFAPR_M5AP_MASK)

#define PFLASH_PFAPR_M4AP_MASK                   (0xC00000U)
#define PFLASH_PFAPR_M4AP_SHIFT                  (22U)
/*! M4AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M4AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M4AP_SHIFT)) & PFLASH_PFAPR_M4AP_MASK)

#define PFLASH_PFAPR_M2AP_MASK                   (0xC000000U)
#define PFLASH_PFAPR_M2AP_SHIFT                  (26U)
/*! M2AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M2AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M2AP_SHIFT)) & PFLASH_PFAPR_M2AP_MASK)

#define PFLASH_PFAPR_M1AP_MASK                   (0x30000000U)
#define PFLASH_PFAPR_M1AP_SHIFT                  (28U)
/*! M1AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M1AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M1AP_SHIFT)) & PFLASH_PFAPR_M1AP_MASK)

#define PFLASH_PFAPR_M0AP_MASK                   (0xC0000000U)
#define PFLASH_PFAPR_M0AP_SHIFT                  (30U)
/*! M0AP - Master n Access Protection
 *  0bx0..This master cannot perform any read accesses
 *  0bx1..This master can perform read accesses
 */
#define PFLASH_PFAPR_M0AP(x)                     (((uint32_t)(((uint32_t)(x)) << PFLASH_PFAPR_M0AP_SHIFT)) & PFLASH_PFAPR_M0AP_MASK)
/*! @} */

/*! @name PFCPGM_PEADR_L - Platform Flash Memory Program Erase Address Logical */
/*! @{ */

#define PFLASH_PFCPGM_PEADR_L_PEADR_L_MASK       (0xFFFFFFFFU)
#define PFLASH_PFCPGM_PEADR_L_PEADR_L_SHIFT      (0U)
/*! PEADR_L - Program Erase Address Logical */
#define PFLASH_PFCPGM_PEADR_L_PEADR_L(x)         (((uint32_t)(((uint32_t)(x)) << PFLASH_PFCPGM_PEADR_L_PEADR_L_SHIFT)) & PFLASH_PFCPGM_PEADR_L_PEADR_L_MASK)
/*! @} */

/*! @name PFCPGM_PEADR_P - Platform Flash Memory Program Erase Address Physical */
/*! @{ */

#define PFLASH_PFCPGM_PEADR_P_PEADR_P_MASK       (0xFFFFFFFFU)
#define PFLASH_PFCPGM_PEADR_P_PEADR_P_SHIFT      (0U)
/*! PEADR_P - Program Erase Address Physical */
#define PFLASH_PFCPGM_PEADR_P_PEADR_P(x)         (((uint32_t)(((uint32_t)(x)) << PFLASH_PFCPGM_PEADR_P_PEADR_P_SHIFT)) & PFLASH_PFCPGM_PEADR_P_PEADR_P_MASK)
/*! @} */

/*! @name PFCPGM_XPEADR_L - Platform Flash Memory Express Program Erase Address Logical */
/*! @{ */

#define PFLASH_PFCPGM_XPEADR_L_XPEADR_L_MASK     (0xFFFFFFFFU)
#define PFLASH_PFCPGM_XPEADR_L_XPEADR_L_SHIFT    (0U)
/*! XPEADR_L - Express Program Erase Address Logical */
#define PFLASH_PFCPGM_XPEADR_L_XPEADR_L(x)       (((uint32_t)(((uint32_t)(x)) << PFLASH_PFCPGM_XPEADR_L_XPEADR_L_SHIFT)) & PFLASH_PFCPGM_XPEADR_L_XPEADR_L_MASK)
/*! @} */

